src/test/resources/me/dev/misc/xml/util/soap_req.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <greetMe xmlns="http://cxf.apache.org/hello_world_soap_http/types">
      <requestType>Änne</requestType>
    </greetMe>
  </soap:Body>
</soap:Envelope>